package tikaradze.l.problem.bird;
// გვაქვს კლასი bird რომელსაც აქვს მეთოდი fly რომელსაც გადაეცემა პარამეტრი და ამის მიხედვით ასრულებს ფრენის ლოგიკას
// გვაქვს ასევე "სირაქლემას" კლასი რომელიც ქვეკლასია bird კლასის
// სირაქლემას არ შეუძლია ფრენა, ამიტომ მოგვიწევს გადავფაროთ fly მეთოდი და დავტოვოდ ცარიელი.
// მეინ კლასიდან ვქმნით სირაქლემის ტიპის ობიექტს ვიძახებთ ფლაი მეთოდს თუმცა არ მუშაობს რადგან სირაქლემა არ დაფრინავს,
// ჩვენ კი ამ მეთოდს ვხედავთ. სხვა ენაზე რო ვთქვათ პროგრამამ დაასრულა მუშაობა მოულოდნელი შედეგით.

// პრობლემა მდგომარეობს ფრინველის და სირაქლებას დამოკიდებულებაში. ბიოლოგიაში სირაქლემა არის ფრინველი.
// მაგრამ ოოპ-ში და კონკრეტულად ჩვენს პროგრამაში  სირაქლემას  კლასი არ არის სრულად ჩამნაცვლებელი ფრინველის კლასის.
// ჩვენ შევქმენით არასწორი ტიპების დამოკიდებულება.
public class Main {
    public static void main(String[] args) {
        Bird ostrich=new Ostrich();
        ostrich.fly(100);
    }
}
