package tikaradze.l.solved.account;

/**
 *  შევქმენით ორი სპეციფიური ინტერფეისი ლოკალური ტრანსფერებისთვის და ინტერნაციონალური ტრანსფერებისთვის
 *  სასკოლო ანგარიში იმპლიმენტაციას უწევს localAccount ინტერფეისს. რამაც საშუალება მოგვცა სწორი დამოკიდებულება შეგვექმნა
 *  სასკოლო ანგარიშსა და ლოკალურ ანგარიშს შორის და აგვეცილებია თავიდან ლისკოვის პრობლემა
 */

// ეს ინტერფეის სეგრეგერეიშენ პრინციპით ავიცილეთ თავიდან
public class Main {
    public static void main(String[] args) {
        LocalAccount account = new SchoolAccount();
        account.localTransfer(1000);
    }
}
