package tikaradze.l.problem.account;
/**
 * გვაქვს ინტერფეისი  account -ი რომელსაც აქვს ორი მეთოდი თანხის ლოკალური ტრანსფერებისთვის და საერთაშორისო ტრანსფერებისთვის
 *
 * ამის შემდეგ შევქმენით schoolAccount კლასი რომელიც იმპლიმენტაციას უწევს account ინტერფეისს .
 *  თუმცა  სასკოლო ბარათზე ჩვენ შეგვიძლია მხოლოდ ლოკალური ჩარიცხვების განხორციელება.(ამავე ქვეყნიდან)
 *
 *  localTransfer -ში ჩავწერეთ ლოკალური გადარიცხვის ლოგიკა
 *
 *  InternationalTransfer - ში ვისვრით ექსეფშენს რადგამ მივანიშნოთ რომ საერთაშორისო გადარიცხვები სასკოლო ბარათზე არ შეიძლება.
 *
 *  როცა შევეცდებით პროგრამის გაშვებას გამოვა ერორი.
 *
 *  ისევ და ისევ იმიტომ რომ ჩვენ გვაქვს არასწორი იერარქია სასკოლო ანგარისსა და ანგარიშ ინტერფეისს შორის .
 *
 *  account ის სრულად ჩამნაცვლებელი არ არის schoolAccount -ი რაც არღვევს ლისკოვის პრინციპს.
 *
 * */
public class Main {
    public static void main(String[] args) {
        Account account=new SchoolAccount();
        account.InternationalTransfer(1000);
    }
}
